In [295]:
import numpy as np
import pandas as pd

In [37]:
Student_Marks=[['Name',['A','B','C','D','E']],
               ['Ankit',[41,34,45,55,63]],
               ['Aravind',[42,23,34,44,53]],
               ['Lakshay',[32,23,13,54,67]],
               ['Gyan',[23,82,23,63,34]],
               ['Pranav',[21,23,25,56,56]]
              ]

In [39]:
Student_Marks

[['Name', ['A', 'B', 'C', 'D', 'E']],
 ['Ankit', [41, 34, 45, 55, 63]],
 ['Aravind', [42, 23, 34, 44, 53]],
 ['Lakshay', [32, 23, 13, 54, 67]],
 ['Gyan', [23, 82, 23, 63, 34]],
 ['Pranav', [21, 23, 25, 56, 56]]]

In [43]:
Student_Marks[2]

['Aravind', [42, 23, 34, 44, 53]]

In [103]:
len(Student_Marks)

6

In [253]:
SM={'Name':['A','B','C','D','E'],
               'Ankit':[41,34,45,55,63],
               'Aravind':[42,23,34,44,53],
               'Lakshay':[32,23,13,54,67],
               'Gyan':[23,82,23,63,34],
               'Pranav':[21,23,25,56,56]
              }

In [259]:
SM

  Name  Ankit  Aravind  Lakshay  Gyan  Pranav
0    A     41       42       32    23      21
1    B     34       23       23    82      23
2    C     45       34       13    23      25
3    D     55       44       54    63      56
4    E     63       53       67    34      56

In [307]:
SM=pd.DataFrame(SM)

In [313]:
sm=SM.set_index('Name').T

In [316]:
sm

Name      A   B   C   D   E
Ankit    41  34  45  55  63
Aravind  42  23  34  44  53
Lakshay  32  23  13  54  67
Gyan     23  82  23  63  34
Pranav   21  23  25  56  56

In [330]:
sm.sort_values(by=['B'],ascending=False)

Name      A   B   C   D   E
Gyan     23  82  23  63  34
Ankit    41  34  45  55  63
Aravind  42  23  34  44  53
Lakshay  32  23  13  54  67
Pranav   21  23  25  56  56

In [352]:
sm=pd.DataFrame(sm)

In [358]:
highest_B_Mark=sm['B'].max()
highest_B_Mark_Student=sm['B'].idxmax()

In [362]:
print(f"{highest_B_Mark_Student} scored the highest marks in subject B which was {highest_B_Mark}.")

Gyan scored the highest marks in subject B which was 82.

In [370]:
c_avg=sm['C'].mean()
c_avg

28.0

In [372]:
print(f"The average marks scored in C is {c_avg}.")

The average marks scored in C is 28.0.

In [400]:
total=sm.sum(axis=1)
percentage=(total/500)*100
percentage

Ankit      47.6
Aravind    39.2
Lakshay    37.8
Gyan       45.0
Pranav     36.2
dtype: float64

In [420]:
print(f"The highest percentage is scored by {percentage.idxmax()} which is {round(percentage.max(),1)}.")

The highest percentage is scored by Ankit which is 47.6.

In [424]:
SM

  Name  Ankit  Aravind  Lakshay  Gyan  Pranav
0    A     41       42       32    23      21
1    B     34       23       23    82      23
2    C     45       34       13    23      25
3    D     55       44       54    63      56
4    E     63       53       67    34      56